Masmiseim36/nxpSDK/boards/mimxrt700evk/eiq_examples/mpp/static_image_ultraface_view/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitCameraPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitCameraPins(void)
{

    /* Enables the clock for the GPIO2 module */
    CLOCK_EnableClock(kCLOCK_Gpio2);

    gpio_pin_config_t gpio2_pinJ6_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO2_5 (pin J6)  */
    GPIO_PinInit(GPIO2, 5U, &gpio2_pinJ6_config);
    /* Reset IOPCTL0 module */
    RESET_ClearPeripheralReset(kIOPCTL0_RST_SHIFT_RSTn);

    const uint32_t port2_pin0_config = (/* Pin is configured as PIO2_0 */
                                        IOPCTL_PIO_FUNC0 |
                                        /* Disable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_DI |
                                        /* Enable pull-down function */
                                        IOPCTL_PIO_PULLDOWN_EN |
                                        /* Disable input buffer function */
                                        IOPCTL_PIO_INBUF_DI |
                                        /* Normal mode */
                                        IOPCTL_PIO_SLEW_RATE_NORMAL |
                                        /* Analog mux is disabled */
                                        IOPCTL_PIO_ANAMUX_DI |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI);
    /* PORT2 PIN0 (coords: H2) is configured as PIO2_0 => RESET, J53-17 */
    IOPCTL_PinMuxSet(2U, 0U, port2_pin0_config);

    const uint32_t port2_pin1_config = (/* Pin is configured as FLEXIO_D1 */
                                        IOPCTL_PIO_FUNC5 |
                                        /* Disable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_DI |
                                        /* Enable pull-down function */
                                        IOPCTL_PIO_PULLDOWN_EN |
                                        /* Disable input buffer function */
                                        IOPCTL_PIO_INBUF_DI |
                                        /* Normal mode */
                                        IOPCTL_PIO_SLEW_RATE_NORMAL |
                                        /* Analog mux is disabled */
                                        IOPCTL_PIO_ANAMUX_DI |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI);
    /* PORT2 PIN1 (coords: G2) is configured as FLEXIO_D1 => XCLK, J53-8 */
    IOPCTL_PinMuxSet(2U, 1U, port2_pin1_config);

    const uint32_t port2_pin5_config = (/* Pin is configured as PIO2_5 */
                                        IOPCTL_PIO_FUNC0 |
                                        /* Disable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_DI |
                                        /* Enable pull-down function */
                                        IOPCTL_PIO_PULLDOWN_EN |
                                        /* Enables input buffer function */
                                        IOPCTL_PIO_INBUF_EN |
                                        /* Normal mode */
                                        IOPCTL_PIO_SLEW_RATE_NORMAL |
                                        /* Analog mux is disabled */
                                        IOPCTL_PIO_ANAMUX_DI |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI);
    /* PORT2 PIN5 (coords: J6) is configured as PIO2_5 => VSYNC, J53-5 */
    IOPCTL_PinMuxSet(2U, 5U, port2_pin5_config);

    const uint32_t flexio_config = (/* Pin is configured as FLEXIO_D10 */
                                         IOPCTL_PIO_FUNC5 |
                                         /* Disable pull-up / pull-down function */
                                         IOPCTL_PIO_PUPD_DI |
                                         /* Enable pull-down function */
                                         IOPCTL_PIO_PULLDOWN_EN |
                                         /* Enables input buffer function */
                                         IOPCTL_PIO_INBUF_EN |
                                         /* Normal mode */
                                         IOPCTL_PIO_SLEW_RATE_NORMAL |
                                         /* Analog mux is disabled */
                                         IOPCTL_PIO_ANAMUX_DI |
                                         /* Pseudo Output Drain is disabled */
                                         IOPCTL_PIO_PSEDRAIN_DI |
                                         /* Input function is not inverted */
                                         IOPCTL_PIO_INV_DI);
    /* PORT2 PIN2 (coords: H3) is configured as FLEXIO_D2 => HREF, J53-6 */
    IOPCTL_PinMuxSet(2U, 2U, flexio_config);

    /* PORT2 PIN6 (coords: H6) is configured as FLEXIO_D6 => D0, J53-16 */
    IOPCTL_PinMuxSet(2U, 6U, flexio_config);

    /* PORT2 PIN7 (coords: G6) is configured as FLEXIO_D7 => D1, J53-15 */
    IOPCTL_PinMuxSet(2U, 7U, flexio_config);

    /* PORT2 PIN8 (coords: G4) is configured as FLEXIO_D8 => D2, J53-14 */
    IOPCTL_PinMuxSet(2U, 8U, flexio_config);

    /* PORT2 PIN9 (coords: G5) is configured as FLEXIO_D9 => D3, J53-13 */
    IOPCTL_PinMuxSet(2U, 9U, flexio_config);

    /* PORT2 PIN10 (coords: F5) is configured as FLEXIO_D10 => D4, J53-12 */
    IOPCTL_PinMuxSet(2U, 10U, flexio_config);

    /* PORT2 PIN11 (coords: F3) is configured as FLEXIO_D11 => D5, J53-11 */
    IOPCTL_PinMuxSet(2U, 11U, flexio_config);

    /* PORT2 PIN12 (coords: E3) is configured as FLEXIO_D12 => D6, J53-10 */
    IOPCTL_PinMuxSet(2U, 12U, flexio_config);

    /* PORT2 PIN13 (coords: E4) is configured as FLEXIO_D13 => D7, J53-09 */
    IOPCTL_PinMuxSet(2U, 13U, flexio_config);

    /* PORT2 PIN15 (coords: D3) is configured as FLEXIO_D15 => PCLK, J53-7 */
    IOPCTL_PinMuxSet(2U, 15U, flexio_config);
}

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
